*LE CLIENTE E MOSTRA MENSAGEM SE A CHAVE NÃO EXISTE
LE-CLIENTE.
    ACCEPT SS-CHAVE
    IF NOT COB-CRT-STATUS = COB-SCR-ESC
        READ FILE1
            IVALID KEY
                MOVE "CLIENTE NÃO ENCONTRADO" TO WS-MSGERRO
                PERFORM MOSTRA-ERRO
            END-READ
        ELSE
        MOVE 99 TO FS-STAT
        END-IF.
    LE-CLIENTE-FIM.